espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_adi_4_aux.h
// Field:     [6] COMPA_REF_CURR_EN
//
// Enables 2uA IPTAT current from ISRC to COMPA reference node. Requires
// ISRC.EN = 1. Used with COMPA_REF_RES_EN to generate voltage reference for
// cap-sense.
#define ADI_4_AUX_COMP_COMPA_REF_CURR_EN                            0x00000040
#define ADI_4_AUX_COMP_COMPA_REF_CURR_EN_M                          0x00000040
#define ADI_4_AUX_COMP_COMPA_REF_CURR_EN_S                                   6

// Field:   [5:3] LPM_BIAS_WIDTH_TRIM
//
// Internal. Only to be used through TI provided API.
#define ADI_4_AUX_COMP_LPM_BIAS_WIDTH_TRIM_W                                 3
#define ADI_4_AUX_COMP_LPM_BIAS_WIDTH_TRIM_M                        0x00000038
#define ADI_4_AUX_COMP_LPM_BIAS_WIDTH_TRIM_S                                 3

// Field:     [2] COMPB_EN
//
// COMPB enable
#define ADI_4_AUX_COMP_COMPB_EN                                     0x00000004
#define ADI_4_AUX_COMP_COMPB_EN_M                                   0x00000004
#define ADI_4_AUX_COMP_COMPB_EN_S                                            2

// Field:     [0] COMPA_EN
//
// COMPA enable
#define ADI_4_AUX_COMP_COMPA_EN                                     0x00000001
#define ADI_4_AUX_COMP_COMPA_EN_M                                   0x00000001
#define ADI_4_AUX_COMP_COMPA_EN_S                                            0

//*****************************************************************************
//
// Register: ADI_4_AUX_O_MUX4
//
//*****************************************************************************
// Field:   [7:0] COMPA_REF
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// AUXIO19                  Internal. Only to be used through TI provided API.
// AUXIO20                  Internal. Only to be used through TI provided API.
// AUXIO21                  Internal. Only to be used through TI provided API.
// AUXIO22                  Internal. Only to be used through TI provided API.
// AUXIO23                  Internal. Only to be used through TI provided API.
// AUXIO24                  Internal. Only to be used through TI provided API.
// AUXIO25                  Internal. Only to be used through TI provided API.
// AUXIO26                  Internal. Only to be used through TI provided API.
// NC                       Internal. Only to be used through TI provided API.
#define ADI_4_AUX_MUX4_COMPA_REF_W                                           8
#define ADI_4_AUX_MUX4_COMPA_REF_M                                  0x000000FF
#define ADI_4_AUX_MUX4_COMPA_REF_S                                           0
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO19                            0x00000080
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO20                            0x00000040
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO21                            0x00000020
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO22                            0x00000010
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO23                            0x00000008
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO24                            0x00000004
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO25                            0x00000002
#define ADI_4_AUX_MUX4_COMPA_REF_AUXIO26                            0x00000001
#define ADI_4_AUX_MUX4_COMPA_REF_NC                                 0x00000000

//*****************************************************************************
//
// Register: ADI_4_AUX_O_ADC0
//
//*****************************************************************************
// Field:     [7] SMPL_MODE
//
// ADC Sampling mode:
//
// 0: Synchronous mode
// 1: Asynchronous mode
//
// The ADC does a sample-and-hold before conversion. In synchronous mode the
// sampling starts when the ADC clock detects a rising edge on the trigger
// signal. Jitter/uncertainty will be inferred in the detection if the trigger
// signal originates from a domain that is asynchronous to the ADC clock.
// SMPL_CYCLE_EXP  determines the the duration of sampling.
// Conversion starts immediately after sampling ends.
//
// In asynchronous mode the sampling is continuous when enabled. Sampling ends
// and conversion starts immediately with the rising edge of the trigger
// signal. Sampling restarts when the conversion has finished.
// Asynchronous mode is useful when it is important to avoid jitter in the
// sampling instant of an externally driven signal
#define ADI_4_AUX_ADC0_SMPL_MODE                                    0x00000080
#define ADI_4_AUX_ADC0_SMPL_MODE_M                                  0x00000080
#define ADI_4_AUX_ADC0_SMPL_MODE_S                                           7

// Field:   [6:3] SMPL_CYCLE_EXP
//
// Controls the sampling duration before conversion when the ADC is operated in
// synchronous mode (SMPL_MODE = 0). The setting has no effect in asynchronous
// mode. The sampling duration is given as 2^(SMPL_CYCLE_EXP + 1) / 6 us.
// ENUMs:
// 10P9_MS                  65536x 6 MHz clock periods = 10.9ms
// 5P46_MS                  32768x 6 MHz clock periods = 5.46ms
// 2P73_MS                  16384x 6 MHz clock periods = 2.73ms
// 1P37_MS                  8192x 6 MHz clock periods = 1.37ms
// 682_US                   4096x 6 MHz clock periods = 682us
// 341_US                   2048x 6 MHz clock periods = 341us
// 170_US                   1024x 6 MHz clock periods = 170us
// 85P3_US                  512x 6 MHz clock periods = 85.3us
// 42P6_US                  256x 6 MHz clock periods = 42.6us
// 21P3_US                  128x 6 MHz clock periods = 21.3us
// 10P6_US                  64x 6 MHz clock periods = 10.6us
// 5P3_US                   32x 6 MHz clock periods = 5.3us
// 2P7_US                   16x 6 MHz clock periods = 2.7us
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_W                                      4
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_M                             0x00000078
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_S                                      3
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_10P9_MS                       0x00000078
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_5P46_MS                       0x00000070
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_2P73_MS                       0x00000068
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_1P37_MS                       0x00000060
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_682_US                        0x00000058
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_341_US                        0x00000050
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_170_US                        0x00000048
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_85P3_US                       0x00000040
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_42P6_US                       0x00000038
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_21P3_US                       0x00000030
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_10P6_US                       0x00000028
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_5P3_US                        0x00000020
#define ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_2P7_US                        0x00000018

// Field:     [1] RESET_N
//
// Reset ADC digital subchip, active low. ADC must be reset every time it is
// reconfigured.
//
// 0: Reset
// 1: Normal operation
#define ADI_4_AUX_ADC0_RESET_N                                      0x00000002
#define ADI_4_AUX_ADC0_RESET_N_M                                    0x00000002
#define ADI_4_AUX_ADC0_RESET_N_S                                             1

// Field:     [0] EN
//
// ADC Enable
//
// 0: Disable
// 1: Enable
#define ADI_4_AUX_ADC0_EN                                           0x00000001
#define ADI_4_AUX_ADC0_EN_M                                         0x00000001
#define ADI_4_AUX_ADC0_EN_S                                                  0

//*****************************************************************************
//
// Register: ADI_4_AUX_O_ADC1
//
//*****************************************************************************
// Field:     [0] SCALE_DIS
//
// Internal. Only to be used through TI provided API.
#define ADI_4_AUX_ADC1_SCALE_DIS                                    0x00000001
#define ADI_4_AUX_ADC1_SCALE_DIS_M                                  0x00000001
#define ADI_4_AUX_ADC1_SCALE_DIS_S                                           0

//*****************************************************************************
//
// Register: ADI_4_AUX_O_ADCREF0
//
//*****************************************************************************
// Field:     [6] REF_ON_IDLE
//
// Enable ADCREF in IDLE state.
//
// 0: Disabled in IDLE state
// 1: Enabled in IDLE state
//
// Keep ADCREF enabled when ADC0.SMPL_MODE = 0.
// Recommendation: Enable ADCREF always when ADC0.SMPL_CYCLE_EXP is less than
// 0x6 (21.3us sampling time).
#define ADI_4_AUX_ADCREF0_REF_ON_IDLE                               0x00000040
#define ADI_4_AUX_ADCREF0_REF_ON_IDLE_M                             0x00000040
#define ADI_4_AUX_ADCREF0_REF_ON_IDLE_S                                      6

